/* SUAppWindowControllerPriv */

"NOT_NOW_TITLE" = "Nie teraz";
"QUIT_TITLE" = "Zakończ";
"RESCAN_TITLE" = "Sprawdź teraz";

// these are used in the window header area
"NEW_SOFTWARE_TITLE" = "Dostępne jest nowe oprogramowanie dla komputera.";
"NEW_SOFTWARE_MESSAGE" = "Jeśli nie chcesz instalować teraz, możesz wybrać w dogodnym dla siebie czasie opcję Uaktualnienia z menu Apple.";
// these are used in the window header area and in sheets
"UP_TO_DATE_TITLE" = "Oprogramowanie jest aktualne.";
"UP_TO_DATE_MESSAGE" = "Program Uaktualnienia programów nie ma obecnie nowego oprogramowania dla tego komputera.";
"UP_TO_DATE_WITH_IGNORED_MESSAGE" = "Nie ma żadnych nowych uaktualnień poza tymi, które są ignorowane. Spróbuj ponownie później.";
"RESET_IGNORED_UPDATES_TITLE" = "Wyzeruj ignorowane uaktualnienia";
// these are used only in the error sheet
"FAILED_SCAN_NETWORK_ERROR_TITLE" = "Program Uaktualnienia programów nie może sprawdzić dostępności uaktualnień z powodu problemu z siecią.";
"FAILED_SCAN_OTHER_ERROR_TITLE" = "Nie udało się sprawdzić dostępności uaktualnień.";
"NETWORK_DIAGNOSTICS_TITLE" = "Diagnostyka sieci…";
// these are used only when a non-standard catalog URL is set (Software Update Server)
"FAILED_SCAN_SUS_ERROR_TITLE" = "Serwer uaktualnień oprogramowania (%@) nie odpowiada.";
"FAILED_SCAN_SUS_ERROR_MESSAGE" = "Sprawdź, czy połączenie sieciowe działa normalnie. Jeśli nie ma problemów z połączeniem, skontaktuj się z administratorem sieci, aby uzyskać pomoc.";

// dealing with multiple SU sessions
"OTHER_SESSION_USER_TITLE" = "%@ właśnie instaluje uaktualnienia.";
"OTHER_SESSION_UNKNOWN_TITLE" = "Inny użytkownik instaluje właśnie uaktualnienia.";
"OTHER_SESSION_SAME_TITLE" = "Trwa instalowanie uaktualnień.";
"OTHER_SESSION_MESSAGE" = "Możesz później sprawdzić dostępność uaktualnień, wybierając „Uaktualnienia” z menu Apple.";
"OTHER_DONE_USER_TITLE" = "Uaktualnienia zostały zainstalowane przez użytkownika %@. Czy chcesz sprawdzić dostępność kolejnych uaktualnień?";
"OTHER_DONE_UNKNOWN_TITLE" = "Uaktualnienia zostały zainstalowane przez innego użytkownika. Czy chcesz sprawdzić dostępność kolejnych uaktualnień?";
"OTHER_DONE_SAME_TITLE" =  "Uaktualnienia zostały zainstalowane. Czy chcesz sprawdzić dostępność kolejnych uaktualnień?";
"OTHER_DONE_MESSAGE" = "Jeżeli nie sprawdzisz dostępności uaktualnień teraz, możesz zrobić to później, wybierając „Uaktualnienia” z menu Apple.";

// External Testing Mode Warnings
"DANGER_SIGNATURE_CHECK_OFF_TITLE" = "Ostrzeżenie: Sprawdzanie podpisu Apple wyłączone";
"DANGER_SIGNATURE_CHECK_OFF_INFO" = "Program Uaktualnienia programów działa obecnie w trybie testowym, co nie jest wystarczające bezpieczne dla zwykłego użytkowania. W tym trybie akceptowane są uaktualnienia o dowolnym „zaufanym” podpisie (niekoniecznie firmy Apple). Jeśli nie testujesz pakietów Uaktualnień programów innych firm, zalecamy natychmiastowe zaprzestanie używania Uaktualnień programów Apple.";
"DANGER_SIGNATURE_CHECK_OFF_USE_IN_TEST_BUTTON" = "Używaj w trybie testowym";
"DANGER_SIGNATURE_CHECK_OFF_QUIT_BUTTON" = "Zakończ";

/* SUAppDetailedView */
"LogOutRequired" = "Po zainstalowaniu uaktualnień musisz się wylogować";
"LogOutRequired_Single" = "Po zainstalowaniu uaktualnienia musisz się wylogować";
"RestartRequired" = "Po zainstalowaniu uaktualnień musisz ponownie uruchomić komputer.";
"RestartRequired_Single" = "Po zainstalowaniu uaktualnienia musisz ponownie uruchomić komputer.";
"ShutDownRequired" = "Po zainstalowaniu uaktualnień musisz wyłączyć komputer.";
"ShutDownRequired_Single" = "Po zainstalowaniu uaktualnienia musisz wyłączyć komputer.";
"RestartRecommended" = "Po zainstalowaniu uaktualnień zalecamy ponownie uruchomić komputer.";
"RestartRecommended_Single" = "Po zainstalowaniu uaktualnienia zalecamy ponownie uruchomić komputer.";

"Install" = "Instaluj";
"Install1Item" = "Instaluj 1 rzecz";
"InstallNItems" = "Instaluj %d rzeczy";

/* Used for AXRoleDescription of restart requirement badges */
"RestartRequirementIndicatorRoleDescription" = "wskaźnik";


/* SUAppProductItem */
"INSTALLED_LABEL" = "Zainstalowane";
"PARTIALLY_DOWNLOADED_LABEL_FORMAT" = "Częściowo pobrane (%d%%)";
"DOWNLOADED_LABEL" = "Pobrane";
"ERROR_LABEL" = "Błąd";

"SELECTION_LABEL_FORMAT" = "%@: %@.";

"DOWNLOAD_MENU_ITEM_GENERIC" = "Przejdź do strony pobierania Apple…";
"DOWNLOAD_MENU_ITEM_PRODUCT" = "Przejdź do strony pobierania „%@”…";


/* SUAppProductItemController */
"ConfirmMakeInactive1ItemTitle" = "Czy na pewno chcesz usunąć uaktualnienie „%@” z listy?";
"ConfirmMakeInactive1ItemMessage" = "System nie będzie już powiadamiał o nowych wersjach tego uaktualnienia. Aby wyświetlać je znowu, wybierz opcję Wyzeruj ignorowane uaktualnienia z menu Uaktualnienia programów.";
"ConfirmMakeInactiveNItemsTitle" = "Czy na pewno chcesz usunąć te uaktualnienia (w liczbie %d) z listy?";
"ConfirmMakeInactiveNItemsMessage" = "System nie będzie już powiadamiał o nowych wersjach tych uaktualnień. Aby wyświetlać je znowu, wybierz opcję Wyzeruj ignorowne uaktualnienia z menu Uaktualnienia programów.";

"OK_TITLE" = "OK";
"CANCEL_TITLE" = "Anuluj";

"RESCAN_ERROR_TITLE" = "Wystąpił błąd podczas sprawdzania dostępności uaktualnień.";
